# Pandas

## --------Series-------- <br>
<span style= "color:red;">Note: Series can hold almost any type of data, even references to functions</span>

In [1]:
import numpy as np
import pandas as pd

In [39]:
labels = ['a','b','c']
my_data = [10,20,30]
array = np.array(my_data)
dict = {'a':10,"b":20,'c':30}

#### - Creating a series from list

- With Default index

In [31]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

- With user provided index

In [32]:
pd.Series(data = my_data , index = labels)

a    10
b    20
c    30
dtype: int64

- instead of explicitly mentioning the data and index, if the order is proper it is not required

In [33]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

#### Creating a Series from a NumPy array

In [40]:
pd.Series(array,labels)

a    10
b    20
c    30
dtype: int32

#### - Creating a Series from dictornary <br>
If dictionary is given as parameter to create a Series, the key will be taken as index and value as data

In [35]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

- Example of how series can hold different data types

In [41]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [42]:
pd.Series(data =[sum,max,min,print] )

0      <built-in function sum>
1      <built-in function max>
2      <built-in function min>
3    <built-in function print>
dtype: object

### Grabbing Information from Series

In [43]:
ser1 = pd.Series([1,2,3,4],["INDIA","USA","ITALY","CHINA"])

In [44]:
ser1

INDIA    1
USA      2
ITALY    3
CHINA    4
dtype: int64

In [45]:
ser2 = pd.Series([1,2,7,8],["INDIA","USA","NEPAL","SRILANKA"])

In [46]:
ser2

INDIA       1
USA         2
NEPAL       7
SRILANKA    8
dtype: int64

In [47]:
ser1["USA"]

2

 - Adding two Series<br>

The common elements will be added according to the labels and the labels which are not available in both series will give output as NaN. <br>
The integers will be converted into float to avoid loss of data

In [48]:
ser1 + ser2

CHINA       NaN
INDIA       2.0
ITALY       NaN
NEPAL       NaN
SRILANKA    NaN
USA         4.0
dtype: float64

 ## --------DataFrames--------

In [52]:
from numpy.random import randn

#### random.seed() is used to get same random numbers all the time

In [51]:
np.random.seed(101)

In [53]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Getting data from a column
- Bracket and Index method (recommended method)

In [55]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [56]:
type(df['W'])

pandas.core.series.Series

- dot (.) method, not recommended because the column name can be the built-in method name which may cause confusion

In [60]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

#### Getting multiple columns
To get multiple columns, pass list of list as index

In [64]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

#### Adding new columns

In [65]:
df['mynewcol'] = df['W']

In [66]:
df

          W         X         Y         Z  mynewcol
A  2.706850  0.628133  0.907969  0.503826  2.706850
B  0.651118 -0.319318 -0.848077  0.605965  0.651118
C -2.018168  0.740122  0.528813 -0.589001 -2.018168
D  0.188695 -0.758872 -0.933237  0.955057  0.188695
E  0.190794  1.978757  2.605967  0.683509  0.190794

#### Deleting columns<br>
drop('col_name') method is used drop the column<br>
We have to mention axis = 1 because drop method refers to index, i.e rows, so to get it working we have to add axis parameter with value 1

In [69]:
df.drop('mynewcol',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z  mynewcol
A  2.706850  0.628133  0.907969  0.503826  2.706850
B  0.651118 -0.319318 -0.848077  0.605965  0.651118
C -2.018168  0.740122  0.528813 -0.589001 -2.018168
D  0.188695 -0.758872 -0.933237  0.955057  0.188695
E  0.190794  1.978757  2.605967  0.683509  0.190794

As we have seen the dataframe still have mynewcol, we have to add one more parameter to the drop method, i.e inplace with value true. We have to do it because we won't loose any data accidentally<br>
Lets see by adding inplace parameter

In [71]:
df.drop("mynewcol",axis = 1, inplace = True)

In [72]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

And in this way we have dropped the column

#### Dropping a row<br>
In this case as axis is by default 0 we have not to mention that parameter explicitly

In [73]:
 df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Explanation for why axis is 0 for rows and 1 for columns

In [75]:
df.shape

(5, 4)

Self explanatory, 5 is the number of rows here and 4 is number of columns

#### Selecting a Row<br>
There are two ways to select a row,
- Using label, loc[] method

In [78]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

- Using index, iloc[] method

In [79]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

Selecting rows again return a series as in dataframes it is treated as series as well

#### Selecting subsets of rows and columns

In [80]:
df.loc['C','Y']

0.5288134940893595

- Multiple subsets, pass a list of list

In [83]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### - Conditional Selection

selecting dataframe greater than zero

In [84]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [85]:
booldf = df > 0

In [86]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

If we pass this booldf in original dataframe, that will give us all the values which are true and return NaN where value is false

In [87]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

Instead of doing above, shorthand way of doing condtional selection is as follows:

In [91]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

- Conditional selection for particular column

In [92]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

- Selecting only true values for a given condition of a column

In [93]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

#### Tip : Instead of just writing command like 'df[df['W']>0]', store it in a variable in order to use the resulting dataframe as subset of original dataframe

In [95]:
resultfd = df[df['W'] > 0]

In [96]:
resultfd

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
resultfd['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

Shorthand way of doing all this is :

In [98]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [99]:
df[df['W'] > 0] [['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

### Multiple conditions

- For giving multiple conditions, we cannot use pythons and operator because it is used only to compare single boolean values like True and True, it cannot be used with the pandas series
- To use and or or opertor in pandas to operate on series or dataframes we have to use '&' or '|' operators for **and** and **or** operations respectively

In [101]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### Setting and Resetting Index<br>
- The index will be resetted to numerical i.e default index and the earlier one will be converted into a seperate column
- Again if we don't use inplace it will not be reflected in the original dataframe

In [102]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [110]:
newind = 'MH GJ RJ MP UP'.split()

;) a quick way to create a list

In [105]:
newind

['MH', 'GJ', 'RJ', 'MP', 'UP']

In [106]:
df['states'] = newind

In [107]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     MH
B  0.651118 -0.319318 -0.848077  0.605965     GJ
C -2.018168  0.740122  0.528813 -0.589001     RJ
D  0.188695 -0.758872 -0.933237  0.955057     MP
E  0.190794  1.978757  2.605967  0.683509     UP

In [108]:
df.set_index('states')

               W         X         Y         Z
states
MH      2.706850  0.628133  0.907969  0.503826
GJ      0.651118 -0.319318 -0.848077  0.605965
RJ     -2.018168  0.740122  0.528813 -0.589001
MP      0.188695 -0.758872 -0.933237  0.955057
UP      0.190794  1.978757  2.605967  0.683509

### - Multi Index Level Dataframe

In [118]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = '1 2 3 1 2 3'.split()
h_index = list(zip(outside,inside))
h_index = pd.MultiIndex.from_tuples(h_index)

In [120]:
df = pd.DataFrame(randn(6,2),h_index,['A','B'])

In [121]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

#### Selecting data from such dataframes<br>
calling from outside index

In [122]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

Calling outside and inside index to get series of dataframe as output

In [124]:
df.loc['G1'].loc['1']

A    0.302665
B    1.693723
Name: 1, dtype: float64

Knowing Names of Index

In [125]:
df.index.names

FrozenList([None, None])

In [126]:
df.index.names = ["Groups","Nos"]

In [127]:
df

                   A         B
Groups Nos
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [128]:
df.loc['G2'].loc['2']['B']

0.07295967531703869

In [129]:
df.loc['G2'].loc['3']['A']

0.638787013499328

#### Cross Section<br>
xs() method is used to avoid multilevel issues to select the data easily

In [130]:
df.xs('G1')

            A         B
Nos
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [131]:
df.xs('1',level="Nos")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Handling Missing Values

In [132]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [133]:
df = pd.DataFrame(d)

In [134]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Dropping NaN values
dropna() method is used to drop all the rows which consist one or more NaN values. It drops the rows since the axis parameter is by default set to 0. <br>
To drop the columns we can set the axis parameter to 1

In [135]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [136]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

- using thresh parameter.
thresh parameter is integer value which describes the threshold value for the rows or columns to get dropped.

In [137]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### Filling NaN values
fillna() method is used to fill or replace NaN values

In [140]:
df.fillna(value = "FILLED")

        A       B  C
0       1       5  1
1       2  FILLED  2
2  FILLED  FILLED  3

In [141]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

In [144]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [167]:
df = pd.DataFrame(data)

#### Using Groupby on a particular  column<br>
Then we can use various aggregate functions over it

In [163]:
comp_group = df.groupby('Company')

In [165]:
comp_group.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [169]:
comp_group.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [170]:
comp_group.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

- We can notice that all non numeric columns are ignored while using mathematical functions

#### Shorthand way to do all this is

In [168]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [172]:
df.groupby('Company').std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [173]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [174]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [175]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

Max and min also returns the Person which returns it according to character<br>
<h3><span style = "color : red"> NOTE: Dont use max and min or any aggregate functions with string </span></h3>

<h2>Describe() method </h2> <br>
It gives all the details of the group like count, mean ,standard deviation, min & max, sales quarters

In [177]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

#### Use transpose to change the format and make company as a column

In [178]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

#### Checking decription of particular company

In [179]:
df.groupby("Company").describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Concatenation of Dataframes

In [180]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [181]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [182]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [183]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Note that the dimensions of the dataframes should match for concatenation

In [187]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenating along columns, i.e  make axis parameter set to 1

In [188]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

It has NaN values since the dataframes doesnt have the data at the index where NaN is shown above

### Merging

In [189]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [190]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [191]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### merge() method is used to merge two dataframes <br>
First two parameters are dataframes,how is the parameter which defines how the dataframes should be joined (in this case inner joine, same as we do in sql) and on parameter is used to define on which column mergining is performed <br>
- With one key column

In [192]:
pd.merge(left,right,how="inner",on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

- With multiple key column

In [194]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [196]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [197]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [199]:
pd.merge(left,right,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [200]:
pd.merge(left,right,how = 'outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

#### Joining

- Similar to merging except the key here are index and not seperate columns

In [201]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [202]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [203]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [205]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [206]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [207]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Other useful Operations

In [208]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [209]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Finding unique values in a dataframe

- using unique() method <br>
this will return all the unique values from the dataframe

In [211]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

 To know the actual number of elements, use len() function

In [212]:
len(df['col2'].unique())

3

- Alternate method for above thing is:

In [213]:
df['col2'].nunique()

3

- Another method to do this thing is value_counts() which will return the frequency of each value of dataframe

In [214]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

<h3>Apply Method</h3><br>
Apply method is very powerful pandas feature which allows us to use any user-defined or built-in functions and apply them onto our data frames. Lambda expressions can also be applied using this method

- Buit-in Function

In [215]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [216]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

- User-defined Functions

In [218]:
def timesx2(var):
    return var*2

In [219]:
df['col2'].apply(timesx2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

- Lambda Expressions/Functions :

In [220]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

### Getting column and index names :

In [221]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [222]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting a dataframe
Sorting doesn't makes any changes for index

In [224]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Finding Null Values in Dataframe
isnull() method returns True if data is null else returns False

In [226]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Tables

In [227]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [228]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [229]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN